In [1]:
temp = input("enter the temparature")
degree = int(temp[:-1])
if:
    result = int(round((9*degree)/5 +32)
    conversion = "Fahrenheit"
elif:
    result = int(round(degree -32)* (5/9))
    conversion = "Celsius"
else:
    print("check the input")
print("the temparture in",convention,"is",result,"degrees")

SyntaxError: invalid syntax (<ipython-input-1-4ceb8a8b1854>, line 3)

In [5]:
temp = input("Input the temperature you like to convert? (e.g 45F,102C..etc) : ")
degree = int(temp[:-1])
i_convention = temp[-1]
if i_convention.upper() == 'C':
    result = int(round((9 * degree)/5 + 32))
    o_convention = "Fahrenheit"
elif i_convention.upper() == 'F':
    result = int(round((degree - 32)* 5/9))
    o_convention = 'Celsius'
else:
    print("Input Proper Convention")
print("The temperature in ",o_convention," is ",result," degrees")

Input the temperature you like to convert? (e.g 45F,102C..etc) :  55F

The temperature in  Celsius  is  13  degrees

In [1]:
import pandas as pd

In [2]:
series=pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
a=pd.Series([2,4,6,8,10])
print(type(a))
print(a.tolist())
print(a.totuple())

<class 'pandas.core.series.Series'>
[2, 4, 6, 8, 10]

AttributeError: 'Series' object has no attribute 'totuple'

In [11]:
a=pd.Series([2, 4, 6, 8, 10])
b=pd.Series([1, 3, 5, 7, 9])

In [12]:
print(a+b)

0     3
1     7
2    11
3    15
4    19
dtype: int64

In [13]:
print(a-b)

0    1
1    1
2    1
3    1
4    1
dtype: int64

In [19]:
a=pd.Series([2, 4, 6, 8, 10])
b=pd.Series([1, 4, 5, 7, 10])

In [26]:
c=a[a.isin(b)]

In [27]:
c

1     4
4    10
dtype: int64

In [29]:
a=pd.Series({'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800})

In [30]:
a

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [34]:
import numpy as np

In [37]:
arr=np.array([10,20,30,40,50])
pd.Series(arr)

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [47]:
q=pd.Series(['100','200','python','300.12','400'])
pd.to_numeric(q, errors='coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [52]:
a=pd.Series({'col1':[1,2,3,4,7,11]})

In [53]:
a

col1    [1, 2, 3, 4, 7, 11]
dtype: object

In [64]:
a=pd.Series([100,200,python,300.12,400])
np.array(a.values.tolist())

array([100.  , 200.  ,   0.  , 300.12, 400.  ])

In [90]:
a=pd.Series([['Red', 'Green', 'White'],['Red', 'Black'],['Yellow']])
s=a.apply(pd.Series).stack().reset_index(drop=True)

In [91]:
s

0       Red
1     Green
2     White
3       Red
4     Black
5    Yellow
dtype: object

In [111]:
a=pd.Series([100,200,python,300.12,400])
a.sort_values()

2      0.00
0    100.00
1    200.00
3    300.12
4    400.00
dtype: float64

In [96]:
a=pd.Series([100,200,python,300.12,400])

In [108]:
a.append(pd.Series([500,600]))

   index       0
0      0  100.00
1      1  200.00
2      2    0.00
3      3  300.12
4      4  400.00
5      0  500.00
6      1  600.00

In [112]:
import math

In [113]:
a=pd.Series([100,200,500,300.12,400])
a.mean()

300.024

In [114]:
a.std()

158.11389211577836

In [124]:
ser1=pd.Series([1,2,3,4,5])
ser2=pd.Series([2,4,6,8,10])
ser=ser1[~ser1.isin(ser2)]

In [125]:
ser

0    1
2    3
4    5
dtype: int64

In [129]:
a=pd.Series([3.000938,11.370722,14.612143,8.990256,13.925283,12.056875,11.8931,8.247458,5.526727])

In [140]:
a.min(),a.max(),a.median()

(3.000938, 14.612143, 11.370722)

In [141]:
Minimum, 25th percentile, median, 75th, and maximum

SyntaxError: invalid syntax (<ipython-input-141-c3dc725b0e79>, line 1)

In [144]:
import timeit
a=pd.Series(['1 Jan 2015','10-02-2016','20180307','2014/05/06','2016-04-12','2019-04-06T11:20'])

In [148]:
pd.to_datetime(a)

0   2015-01-01 00:00:00
1   2016-10-02 00:00:00
2   2018-03-07 00:00:00
3   2014-05-06 00:00:00
4   2016-04-12 00:00:00
5   2019-04-06 11:20:00
dtype: datetime64[ns]

In [153]:
from dateutil.parser import parse

In [154]:
parse(a).dt.day.tolist()

TypeError: Parser must be a string or character stream, not Series

In [155]:
result = a.map(lambda d: parse('11 ' + d))

ParserError: Unknown string format: 11 10-02-2016

In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [4]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

In [7]:
df=pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']},index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])

In [8]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [21]:
df.describe()

           score   attempts
count   8.000000  10.000000
mean   13.562500   1.900000
std     4.693746   0.875595
min     8.000000   1.000000
25%     9.000000   1.000000
50%    13.500000   2.000000
75%    17.125000   2.750000
max    20.000000   3.000000

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [24]:
df.iloc[0:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [35]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [36]:
df[['score','qualify']]

   score qualify
a   12.5     yes
b    9.0      no
c   16.5     yes
d    NaN      no
e    9.0      no
f   20.0     yes
g   14.5     yes
h    NaN      no
i    8.0      no
j   19.0     yes

In [38]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [46]:
df[df['attempts'] > 2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [51]:
len(df.axes[0])
len([df.axes[1])

SyntaxError: closing parenthesis ')' does not match opening parenthesis '[' (<ipython-input-51-ff2af10ae3a2>, line 2)

In [58]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [69]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

In [78]:
df[(df['attempts']<2) & (df['score']>15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [79]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [85]:
df.axes[0][3]

'd'

In [88]:
df.loc['d','score']=11.5

In [89]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [96]:
df['attempts'].sum()

19

In [101]:
df['score'].mean()

13.333333333333334

In [115]:
df.loc['k']=['suresh',15.5,1,'yes']

In [116]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes
k     suresh   15.5         1     yes

In [118]:
df.drop('k')

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [123]:
df.sort_values(by=['name','score'],ascending=[True,False])

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
e      Emily    9.0         2      no
d      James   11.5         3      no
j      Jonas   19.0         1     yes
c  Katherine   16.5         2     yes
i      Kevin    8.0         2      no
h      Laura    NaN         1      no
g    Matthew   14.5         1     yes
f    Michael   20.0         3     yes
k     suresh   15.5         1     yes